yt11dev.СК/src/Documents/СК_Перемещение/СК_Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СК_Перемещение</name>
  <registerRecords>AccumulationRegister.СК_ТоварыНаСкладах</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.СК_Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПриемник</name>
      <type>
        <types>CatalogRef.СК_Ячейки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

yt11dev.СК/src/AccumulationRegisters/СК_ТоварыНаСкладах/СК_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СК_ТоварыНаСкладах</name>
  <resources>
    <name>Вналичии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

yt11dev.СК/src/Documents/СК_Перемещение/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Попытка
		Движения.СК_ТоварыНаСкладах.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.СК_ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.ЯчейкаОтправитель;
			Движение.Вналичии = ТекСтрокаТовары.Количество;
		КонецЦикла;
	//Исключение  
	//	Сообщить("Не Списано");
	//КонецПопытки;
	
	// регистр СХК_ТоварыНаСкладе Приход
	//Попытка
		Движения.СК_ТоварыНаСкладах.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.СК_ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.ЯчейкаПриемник;
			Движение.Вналичии = ТекСтрокаТовары.Количество;
		КонецЦикла;
	//Исключение
	//	Сообщить("Не удалось выполнить перемещение");
	//КонецПопытки;

КонецПроцедуры
